<a href="https://colab.research.google.com/github/FelipeGonzalezGarrido/Coding-Dojo/blob/main/1.%20Data%20Science%20Fundamentals/Semana%202%20-%20Pandas%20for%20Data%20Manipulation/Semana_2_Ejercicios_de_Pandas_Titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

filename = "/content/drive/MyDrive/Data CodingDojo/titanic.csv"

df = pd.read_csv(filename)

In [ ]:
df.columns = df.columns.str.lower()
df.head()

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# 1. Muestren el centro del marco de datos
se asume como las caracteristicas principales del dataframe

In [ ]:
df.shape

(891, 12)

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   passengerid  891 non-null    int64
 1   survived     891 non-null    int64
 2   pclass       891 non-null    int64
 3   name         891 non-null    object
 4   sex          891 non-null    object
 5   age          714 non-null    float64
 6   sibsp        891 non-null    int64
 7   parch        891 non-null    int64
 8   ticket       891 non-null    object
 9   fare         891 non-null    float64
 10  cabin        204 non-null    object
 11  embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [ ]:
df.describe(include="all")

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
count,891.000000,891.000000,891.000000,891,891,714.000000,891.000000,891.000000,891,891.000000,204,889
unique,NaN,NaN,NaN,891,2,NaN,NaN,NaN,681,NaN,147,3
top,NaN,NaN,NaN,"Braund, Mr. Owen Harris",male,NaN,NaN,NaN,347082,NaN,B96 B98,S
freq,NaN,NaN,NaN,1,577,NaN,NaN,NaN,7,NaN,4,644
mean,446.000000,0.383838,2.308642,NaN,NaN,29.699118,0.523008,0.381594,NaN,32.204208,NaN,NaN
std,257.353842,0.486592,0.836071,NaN,NaN,14.526497,1.102743,0.806057,NaN,49.693429,NaN,NaN
min,1.000000,0.000000,1.000000,NaN,NaN,0.420000,0.000000,0.000000,NaN,0.000000,NaN,NaN
25%,223.500000,0.000000,2.000000,NaN,NaN,20.125000,0.000000,0.000000,NaN,7.910400,NaN,NaN
50%,446.000000,0.000000,3.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN
75%,668.500000,1.000000,3.000000,NaN,NaN,38.000000,1.000000,0.000000,NaN,31.000000,NaN,NaN
max,891.000000,1.000000,3.000000,NaN,NaN,80.000000,8.000000,6.000000,NaN,512.329200,NaN,NaN

In [ ]:
df.head()

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

#2. Porcentaje de personas que sobrevivio.

In [ ]:
sobrevivientes = df["survived"].mean()
print(f"Porcentaje de personas que sobrevivieron: {(sobrevivientes*100).round(2)} %")

Porcentaje de personas que sobrevivieron: 38.38 %

In [ ]:
# declaracion de variables
cantidad_sobreviviente = df["survived"].sum()
tarifa_10 = df[df["fare"] < 10]

#3. Cuantos de cada sexo sobrevivieron?

In [ ]:
print(f"Sobrevivieron: {cantidad_sobreviviente}")
df.groupby("sex")["survived"].sum()

Sobrevivieron: 342

sex
female    233
male      109
Name: survived, dtype: int64

#4. Porcentaje de sobrevivientes con pasajes de 10 (dolares ?) o menos

In [ ]:
tarifa_10.groupby("sex")["survived"].mean()

sex
female    0.593750
male      0.106618
Name: survived, dtype: float64

In [ ]:
tarifa_10["survived"].mean()

0.19940476190476192

#5. En total, edad promedio de los que no sobrevivieron

In [ ]:
df[df["survived"] == 0]["age"].mean().round(2)

30.63

#6. En total, edad promedio de los que sobrevivieron

In [ ]:
df[df["survived"] == 1]["age"].mean().round(2)

28.34

# 7. Cual es el promedio de edad de los que sobrevivieron y no, agrupados por sexo?

In [ ]:
df.groupby(["sex","survived"])["age"].mean().round(2)

sex     survived
female  0           25.05
        1           28.85
male    0           31.62
        1           27.28
Name: age, dtype: float64

# Registros null. ["edad"]

El desarrollo de los ejercicios anterior se realizo sin limpiar los registros nulos. que afectan a la columna edad por ende a continuacion se llenaran los registros nulos con el promedio de edad

In [ ]:
df.isna().sum()

passengerid      0
survived         0
pclass           0
name             0
sex              0
age            177
sibsp            0
parch            0
ticket           0
fare             0
cabin          687
embarked         2
dtype: int64

## Promedios a utilizar

In [ ]:
promedio_edad = df["age"].mean()
promedio_edad

29.69911764705882

In [ ]:
df["age"].fillna(promedio_edad, inplace=True)

In [ ]:
#5. En total, edad promedio de los que no sobrevivieron sin null
df[df["survived"] == 0]["age"].mean().round(2)

30.42

In [ ]:
#6. En total, edad promedio de los que sobrevivieron sin null
df[df["survived"] == 1]["age"].mean().round(2)

28.55

In [ ]:
# 7. Cual es el promedio de edad de los que sobrevivieron y no, agrupados por sexo? sin null
df.groupby(["sex","survived"])["age"].mean().round(2)

sex     survived
female  0           26.02
        1           28.98
male    0           31.18
        1           27.63
Name: age, dtype: float64